

"""
დავალებაში წარმოდგენილია ინგლისში გარკვეული წლების მანძილზე ვიზიტორების რეალური მონაცემების შემცველი ფაილი (data_v.xlsx),
რომელშიც მონაცემები დალაგებულია შემდეგი თანმიმდევრობით:

    წელი                -   რომელ წელს იყო ვიზიტი
    თვე                   -   წლის რომელ მეოთხედში ჰქონდა ადგილი ვიზიტს (January-March, April-June, July-September, October-December)
    ქვეყანა             -   რომელი ქვეყნიდანაა ვიზიტორი (New Zealand, United Arab Emirates, Portugal, ...)
    ტრანსპორტი  -   სატრანსპორტო საშუალება, რომლითაც ვიზიტორი შემოვიდა ქვეყანაში (Air, Sea, Tunnel)
    მიზანი             -   ქვეყანაში ვიზიტორის შემოსვლის მიზანი (Holiday, Business, Study, VFR (Visiting friends and relatives), Miscellaneous)
    თანხა               -   ვიზიტორის მიერ დახარჯული თანხა

pandas მოდულის გამოყენებით მოახდინეთ მონაცემების კითხვა შესაბამისი ფაილიდან შესაბამისი დამუშავების შემდეგ 
matplodlib მოდულის გამოყენებით უზრუნველყავით ამ მონაცემების ვიზუალიზირება ორი განსხვავებული დიაგრამის სახით.
მონაცემების დამუშავება უნდა განხორციელდეს ორი პარამეტრის გამოყენებით. მაგალითად:
    1. თუ პირველ პარამეტრად აირჩევთ წელს, ხოლო მეორე პარამეტრად კი აირჩევთ ვიზიტების რაოდენობა. 
        ამ შემთხვევაში მოგიწევთ ვიზიტორების ჯამური რაოდენობის გამოტანა წლების მიხედვით მიუხედავად იმისა რომელი ქვეყნიდან იყო ვიზიტორი.
    
    2. თუ პირველ პარამეტრად აირჩევთ ქვეყანას, ხოლო მეორე პარამეტრად კი რომელიმე სატრანსპორტო საშუალებას, 
        მაშინ დიაგრამაზე უნდა აისახოს რომელი ქვეყნიდან აღნიშნული სატრანსპორტო საშუალებით ჯამურად რამდენმა ვიზიტორმა ისარგებლა.
        აქ არ დაგჭირდებათ სხვა დამატებითი პარამეტრების გათვალისწინება.   
    
    3. და ა.შ.

    თუ რომელ ორ პარამეტრს დააჯგუფებთ გაქვთ სრული თავისუფლება.  

საწყისი მონაცემების პარამეტრების ორი განსხვავებული წყვილის მიმართ დამუშავების შემდეგ საჭიროა შესაბამისი დიაგრამების გამოტანა განსხვავებული ფორმით.
მაგალითად, დიაგრამის წერტილოვანი, ხაზოვანი, სვეტოვანი, წრიული და ა.შ.ფორმებიდან ნებისმიერი ორის  გამოყენებით.
შენიშვნა. მონაცემების ყოველი დამუშავების შემდეგ საჭიროა მხოლოდ ერთი დიაგრამის გამოტანა.
აუცილებელია მონაცემების დამუშავება გაკეთებული იყოს ორი განსხვავებული წყვილის მიმართ."""